In [1]:
import numpy as np

In [2]:
import pandas as pd

In [6]:
labels=['a','b','c','d']
my_list=[10,20,30,40]
arr=np.array(my_list)
d={'a':10,'b':20,'c':30,'d':40}

In [7]:
pd.Series(data=labels)

0    a
1    b
2    c
3    d
dtype: object

In [8]:
pd.Series(data=labels, index=my_list)

10    a
20    b
30    c
40    d
dtype: object

In [9]:
pd.Series(d)

a    10
b    20
c    30
d    40
dtype: int64

In [10]:
pd.Series(my_list,labels)

a    10
b    20
c    30
d    40
dtype: int64

In [22]:
import numpy as np
from numpy.random import randn
np.random.seed(101)

In [39]:
df=pd.DataFrame(randn(4,5),index='a b c d'.split(), columns='1 2 3 4 5'.split())

In [28]:
df

          1         2         3         4         5
a -0.925874  1.862864 -1.133817  0.610478  0.386030
b  2.084019 -0.376519  0.230336  0.681209  1.035125
c -0.031160  1.939932 -1.005187 -0.741790  0.187125
d -0.732845 -1.382920  1.482495  0.961458 -2.141212

In [30]:
df['1']

a   -0.925874
b    2.084019
c   -0.031160
d   -0.732845
Name: 1, dtype: float64

In [31]:
df[['1','2']]

          1         2
a -0.925874  1.862864
b  2.084019 -0.376519
c -0.031160  1.939932
d -0.732845 -1.382920

In [41]:
df['new']=df['1']+df['2']

In [42]:
df

          1         2         3         4         5       new
a  0.992573  1.192241 -1.046780  1.292765 -1.467514  2.184814
b -0.494095 -0.162535  0.485809  0.392489  0.221491 -0.656630
c -0.855196  1.541990  0.666319 -0.538235 -0.568581  0.686794
d  1.407338  0.641806 -0.905100 -0.391157  1.028293  2.049144

In [37]:
df.drop('a',inplace=True)

In [43]:
df

          1         2         3         4         5       new
a  0.992573  1.192241 -1.046780  1.292765 -1.467514  2.184814
b -0.494095 -0.162535  0.485809  0.392489  0.221491 -0.656630
c -0.855196  1.541990  0.666319 -0.538235 -0.568581  0.686794
d  1.407338  0.641806 -0.905100 -0.391157  1.028293  2.049144

In [44]:
df['3']

a   -1.046780
b    0.485809
c    0.666319
d   -0.905100
Name: 3, dtype: float64

In [46]:
df.loc['b']

1     -0.494095
2     -0.162535
3      0.485809
4      0.392489
5      0.221491
new   -0.656630
Name: b, dtype: float64

In [47]:
df

          1         2         3         4         5       new
a  0.992573  1.192241 -1.046780  1.292765 -1.467514  2.184814
b -0.494095 -0.162535  0.485809  0.392489  0.221491 -0.656630
c -0.855196  1.541990  0.666319 -0.538235 -0.568581  0.686794
d  1.407338  0.641806 -0.905100 -0.391157  1.028293  2.049144

In [48]:
df>0

       1      2      3      4      5    new
a   True   True  False   True  False   True
b  False  False   True   True   True  False
c  False   True   True  False  False   True
d   True   True  False  False   True   True

In [49]:
df[df>0]

          1         2         3         4         5       new
a  0.992573  1.192241       NaN  1.292765       NaN  2.184814
b       NaN       NaN  0.485809  0.392489  0.221491       NaN
c       NaN  1.541990  0.666319       NaN       NaN  0.686794
d  1.407338  0.641806       NaN       NaN  1.028293  2.049144

In [51]:
df[df['1']>0]

          1         2        3         4         5       new
a  0.992573  1.192241 -1.04678  1.292765 -1.467514  2.184814
d  1.407338  0.641806 -0.90510 -0.391157  1.028293  2.049144

In [59]:
df

          1         2         3         4         5       new
a  0.992573  1.192241 -1.046780  1.292765 -1.467514  2.184814
b -0.494095 -0.162535  0.485809  0.392489  0.221491 -0.656630
c -0.855196  1.541990  0.666319 -0.538235 -0.568581  0.686794
d  1.407338  0.641806 -0.905100 -0.391157  1.028293  2.049144

In [72]:
df.loc['a'],['1','2']

(1      0.992573
 2      1.192241
 3     -1.046780
 4      1.292765
 5     -1.467514
 new    2.184814
 Name: a, dtype: float64, ['1', '2'])

In [73]:
df

          1         2         3         4         5       new
a  0.992573  1.192241 -1.046780  1.292765 -1.467514  2.184814
b -0.494095 -0.162535  0.485809  0.392489  0.221491 -0.656630
c -0.855196  1.541990  0.666319 -0.538235 -0.568581  0.686794
d  1.407338  0.641806 -0.905100 -0.391157  1.028293  2.049144

In [74]:
df['state']=['mah','guj','goa','mp']

In [75]:
df

          1         2         3         4         5       new state
a  0.992573  1.192241 -1.046780  1.292765 -1.467514  2.184814   mah
b -0.494095 -0.162535  0.485809  0.392489  0.221491 -0.656630   guj
c -0.855196  1.541990  0.666319 -0.538235 -0.568581  0.686794   goa
d  1.407338  0.641806 -0.905100 -0.391157  1.028293  2.049144    mp

In [76]:
df.set_index('state')

              1         2         3         4         5       new
state
mah    0.992573  1.192241 -1.046780  1.292765 -1.467514  2.184814
guj   -0.494095 -0.162535  0.485809  0.392489  0.221491 -0.656630
goa   -0.855196  1.541990  0.666319 -0.538235 -0.568581  0.686794
mp     1.407338  0.641806 -0.905100 -0.391157  1.028293  2.049144